topbar.home=Home
topbar.sobre=Sobre mim
topbar.experiencias=Experi\u00EAncia
topbar.portifolio=Projetos
topbar.formulario=Salve sua mensagem

index.sobre.primeiro.paragrafo=Meu interesse pela programa\u00E7\u00E3o come\u00E7ou na adolesc\u00EAncia quando ganhei meu primeiro computador. Desde ent\u00E3o passei muitas horas imerso no universo de Club Penguin, Minecraft e League of Legends. Aos poucos, fui desenvolvendo um interesse genu\u00EDno sobre como os computadores funcionam. Ent\u00E3o quando chegou a hora de decidir qual faculdade cursar, n\u00E3o me enxerguei em outra profiss\u00E3o que n\u00E3o fosse a de desenvolvedor.
index.sobre.segundo.paragrafo=Antes de entrar na faculdade, tinha muitas d\u00FAvidas: Como \u00E9 poss\u00EDvel uma sequ\u00EAncia de n\u00FAmeros bin\u00E1rios se transformar em uma imagem no monitor? Como algu\u00E9m consegue criar um site? O que \u00E9 nuvem? Bem, rapidamente essas d\u00FAvidas foram sanadas e substitu\u00EDdas por outras novas, como: O que \u00E9 Full-Stack? ou uma API? ou um Framework? ou fazer um deploy?
index.sobre.terceiro.paragrafo=Atualmente, atuo como desenvolvedor full-stack h\u00E1 mais de dois anos e continuo completamente apaixonado pela \u00E1rea. Tive contato com algumas linguagens de programa\u00E7\u00E3o, como Python e C, mas a que mais utilizei profissionalmente foi o Java. Durante esse tempo, a principal li\u00E7\u00E3o que aprendi no universo computacional foi: n\u00E3o existem limites para o conhecimento!
index.sobre.quarto.paragrafo=Portanto, estou empolgado para me conectar e compartilhar experi\u00EAncias com outros entusiastas da tecnologia e inova\u00E7\u00E3o. Juntos podemos transformar nossas ideias em realidade e criar um futuro melhor atrav\u00E9s da tecnologia!

index.especialidade.backend.titulo=Gil Sistemas
index.especialidade.backend.texto=Respons\u00E1vel pela manuten\u00E7\u00E3o e evolu\u00E7\u00E3o de dois servi\u00E7os pr\u00E9-existentes: um desenvolvido em Java com Spring Boot, seguindo a arquitetura Hexagonal, e outro em Java com WebSphere, dentro de uma arquitetura de microsservi\u00E7os.
index.especialidade.frontend.titulo=Dev4Cloud
index.especialidade.frontend.texto=Respons\u00E1vel por projetar e desenvolver solu\u00E7\u00F5es para aplica\u00E7\u00F5es web responsivas utilizando Java com Spring Boot e Groovy com Grails, al\u00E9m de algumas APIs RESTful para diversos clientes. Grande parte dos projetos utilizavam arquitetura de microsservi\u00E7os com RabbitMQ.